SymplexTechnologies/TestBoardCore_nRF52840/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock




nRF52840DK_C.name=My nRF52840 DK

nRF52840DK_C.vid.0=0x1366
nRF52840DK_C.pid.0=0x1015

nRF52840DK_C.build.mcu=cortex-m4
nRF52840DK_C.build.f_cpu=16000000
nRF52840DK_C.build.board=NRF52840_DK_C
nRF52840DK_C.build.core=nRF5
nRF52840DK_C.build.variant=nRF52840DK_C
nRF52840DK_C.build.variant_system_lib=
nRF52840DK_C.build.extra_flags=-DNRF52 -DNRF52840_XXAA -DSWI_DISABLE0 -DOPENTHREAD_ENABLE_APPLICATION_COAP -DUART_ENABLED=0 -D__HEAP_SIZE=0 -DBOARD_PCA10056
nRF52840DK_C.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840DK_C.build.ldscript=openthread_nrf52840.ld

